delivery/ansible/provisioner/docker/apache-benchmark/output/result.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking host.docker.internal (be patient)...INFO: GET header == 
---
GET /api/v1/transfer?reference=TRA-543-318-5633-AA/ HTTP/1.0
Host: host.docker.internal:8095
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
LOG: header received:
HTTP/1.1 200 OK
Date: Fri, 25 Dec 2020 20:17:51 GMT
Vary: Origin
Vary: Access-Control-Request-Method
Vary: Access-Control-Request-Headers
Content-Type: text/plain;charset=utf-8
Content-Length: 38

success received: TRA-543-318-5633-AA/
LOG: Response code = 200
..done


Server Software:        
Server Hostname:        host.docker.internal
Server Port:            8095

Document Path:          /api/v1/transfer?reference=TRA-543-318-5633-AA/
Document Length:        38 bytes

Concurrency Level:      1
Time taken for tests:   0.053 seconds
Complete requests:      20
Failed requests:        0
Total transferred:      4860 bytes
HTML transferred:       760 bytes
Requests per second:    376.24 [#/sec] (mean)
Time per request:       2.658 [ms] (mean)
Time per request:       2.658 [ms] (mean, across all concurrent requests)
Transfer rate:          89.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.1      0       1
Processing:     1    2   1.2      2       6
Waiting:        1    2   0.6      1       3
Total:          2    3   1.2      2       7
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.
WARNING: The median and mean for the waiting time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      3
  75%      3
  80%      3
  90%      5
  95%      7
  98%      7
  99%      7
 100%      7 (longest request)